Revit 2027 API
FabricationPart.CenterlineLength Property
 The centerline length of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CenterlineLength { get; }
Public ReadOnly Property CenterlineLength As Double
	Get
public:
property double CenterlineLength {
	double get ();
}
member CenterlineLength : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace